uhnp/src/InformationRegisters/УниверсальныеКомментарии/УниверсальныеКомментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УниверсальныеКомментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПакетФайлов</name>
    <type>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметКомментирования</name>
    <type>
      <types>CatalogRef.ПредметыКомментирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ПапкиФайлов/ПапкиФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПапкиФайлов</name>
  <comment>Структура папок для хранения файлов</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Шаблоны</name>
      <description>Шаблоны файлов</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьПоEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНапоминания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомпактныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезСистемуВзаимодействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/УниверсальныеКомментарии/Forms/ФормаСпискаКомментариев/Module.bsl
&НаКлиенте
Перем ПроцессЗакрытияФормы; // Неопредлено - никакого завершения небыло. Ложь - в процессе закрытия. Истина - можно закрыть.
&НаКлиенте
Перем ПочтаОтправлена;


#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установим реквизиты формы
	ПредметКомментирования = ЭтаФорма.Параметры.ПредметКомментирования;
	ПрефиксКомментариев = ЭтаФорма.Параметры.ПрефиксКомментариев;
	ПриоритетДобавленияФайлов = ЭтаФорма.Параметры.ПриоритетДобавленияФайлов;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	мПочтовыхАдресов = Неопределено;
	Если ЭтаФорма.Параметры.Свойство("ПочтовыеАдреса", мПочтовыхАдресов) Тогда
		СписокПочтовыхАдресов.ЗагрузитьЗначения(мПочтовыхАдресов);
		ИсточникПисьма = ЭтаФорма.Параметры.ИсточникПисьма;
		мРеквизитыПредметаКомментирования = Неопределено;
		Если ЭтаФорма.Параметры.Свойство("Реквизиты", мРеквизитыПредметаКомментирования) Тогда
			ТекстПисьма = "";
			Для каждого Реквизит_ Из мРеквизитыПредметаКомментирования Цикл
				ТекстПисьма = ТекстПисьма + Реквизит_.Ключ + ": " + Реквизит_.Значение + ". <BR>" + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
		флОтправлятьПочтовыеУведомления = Истина;
	Иначе
		флОтправлятьПочтовыеУведомления = Ложь;
	КонецЕсли; 
	
	// Установить видимость
	Если ЭтаФорма.Параметры.ПоказыватьПредметКомментирования Тогда
		Элементы.ПредставлениеПредметаКомментирования.Видимость = Истина;
		ПредставлениеПредметаКомментирования = УниверсальныеКомментарииУХ.МногострочноеПредставлениеПредметаКомментирования(ПредметКомментирования);
		Элементы.ПредставлениеПредметаКомментирования.Высота = СтрЧислоСтрок(ПредставлениеПредметаКомментирования);
	Иначе
		Элементы.ПредставлениеПредметаКомментирования.Видимость = Ложь;
	КонецЕсли;
	
	ЭлементОтбора = Комментарии.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ПредметКомментирования");
    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование    = Истина;
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение   = ПредметКомментирования;
	
	Если Параметры.ПриоритетДобавленияФайлов Тогда
		Элементы.ГруппаНовыйКомментарий.Видимость = Ложь;
		Элементы.ГруппаНовыйФайл.Видимость = Истина;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Авто;
		Элементы.Комментарии.ИзменятьСоставСтрок = Истина;
		Элементы.ПредставлениеПредметаКомментирования.Видимость = Ложь;
		Заголовок = "Прикрепленные файлы";
		Элементы.ВыбратьИЗаписатьФайл.КнопкаПоУмолчанию = Истина;
		Элементы.Комментарий.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
    Если (НовыйКомментарий <> "" или СписокИменФайлов.Количество() > 0)
		И ПроцессЗакрытияФормы = Неопределено Тогда
		
		// Нельзя закрывать, есть неотправленный комментарий, и пользователь еще не сказал, как к этому относится
		Отказ = Истина;
		Если НЕ ЗавершениеРаботы Тогда
			ОбратныйВызов = Новый ОписаниеОповещения("ОбработатьВопросЗакрытияБезСохраненияКомментария", ЭтотОбъект);
			ПоказатьВопрос(ОбратныйВызов, "Сохранить несохраненный комментарий и/или файл?", РежимДиалогаВопрос.ДаНет)
		Иначе
        	ТекстПредупреждения = "Закрытие формы приведёт к потере неотправленного комментария!";
		КонецЕсли;
		
	ИначеЕсли флОтправлятьПочтовыеУведомления И ПочтаОтправлена <> Истина Тогда
		// Старт отправки почты, и запрет закрытия
		Если НЕ ЗавершениеРаботы Тогда
			ОбработкаЗаписиПриЗакрытииНаКлиенте();
		Иначе
        	Отказ = Истина;
			ПроцессЗакрытияФормы = Ложь; // В процессе
        	ТекстПредупреждения = "Дождаться отправки почтовых оповещений?";
			ПодключитьОбработчикОжидания("ОбработкаЗаписиПриЗакрытииНаКлиенте", 1, Истина);
		КонецЕсли;
	ИначеЕсли ПроцессЗакрытияФормы <> Истина Тогда
		Отказ = Истина;
		ПодключитьОбработчикОжидания("ЗакрытьФормуСпередачейКомментария", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросЗакрытияБезСохраненияКомментария(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПроцессЗакрытияФормы = Ложь; // Начато сохранение данных перед закрытием
		
		Если НовыйКомментарий = "" Тогда
			Окончание_ = ?(СписокИменФайлов.Количество() = 1, "", "ы");
			НовыйКомментарий = "Прикреплен" + Окончание_ + " файл" + Окончание_ + ".";
		КонецЕсли;
		ДобавитьКомментарий(Неопределено);
        
	Иначе
        ПроцессЗакрытияФормы = Истина; // Можно закрывать
		ЗакрытьФормуСпередачейКомментария();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСпередачейКомментария() Экспорт
	ПроцессЗакрытияФормы = Истина;
	Закрыть(ПрефиксКомментариев + ПредыдущийКомментарий);
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыКомментарии


&НаКлиенте
Процедура КомментарииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Комментарии.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле.Имя = "ПакетФайлов" Тогда
		ПакетФайлов = ТекДанные.ПакетФайлов;
		Если ЗначениеЗаполнено(ПакетФайлов) Тогда
			Параметры_ = Новый Структура("Ключ", ПакетФайлов);
			ОткрытьФорму("Справочник.ПапкиФайлов.ФормаОбъекта", Параметры_, ЭтаФорма);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "Комментарий" Тогда
		ПоказатьЗначение(, ТекДанные.Комментарий);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомментарииПриАктивизацииСтроки(Элемент)
		
	ТаблицаФайлы.Отбор.Элементы.Очистить();
	НовЭлементОтбора=ТаблицаФайлы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	НовЭлементОтбора.Использование=Истина;
	НовЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ВладелецФайла");	
	Если Элемент.ТекущиеДанные<>Неопределено Тогда	
		НовЭлементОтбора.ПравоеЗначение=Элемент.ТекущиеДанные.ПакетФайлов;
	Иначе	
		НовЭлементОтбора.ПравоеЗначение=Неопределено;	
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицаФайлы


&НаКлиенте
Процедура ТаблицаФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеФайла = ПолучитьДанныеФайла(Элемент.ТекущиеДанные.Файл, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Файл, УникальныйИдентификатор)
	Возврат РаботаСФайлами.ДанныеФайла(Файл, УникальныйИдентификатор);
КонецФункции


#КонецОбласти


#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	Перем ТекстОшибки;
	
	Если ПустаяСтрока(НовыйКомментарий) И НЕ ПриоритетДобавленияФайлов Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ДобавитьКомментарий", ЭтотОбъект, Новый Структура);	
	ОбщегоНазначенияКлиентУХ.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение,, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗаписатьФайл(Команда)
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыбратьИЗаписатьФайл", ЭтотОбъект);	
	ОбщегоНазначенияКлиентУХ.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение,, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ПрикрепитьФайл", ЭтотОбъект);	
	ОбщегоНазначенияКлиентУХ.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение,, Ложь);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьХранилищеФайла(Данные_)
	Возврат Новый ХранилищеЗначения(Данные_);
КонецФункции

&НаКлиенте
Процедура ЗаписатьКомментарийВРегистр(ПарамтерыФункции)
	Перем ТекстОшибки;
	
	ДатаКомментария = ТекущаяДата();
    КлючЗаписиРегистра = УниверсальныеКомментарииВызовСервераУХ.ЗаписатьКомментарий(ПредметКомментирования, ПрефиксКомментариев+НовыйКомментарий, ДатаКомментария, Пользователь, ПарамтерыФункции.СписокХранилищ, ТекстОшибки);
    Если КлючЗаписиРегистра <> Неопределено Тогда
        Если флОтправлятьПочтовыеУведомления Тогда
            Если ПарамтерыФункции.ТекстИменФайлов <> "" Тогда
                ТекстИменФайлов = Сред(ПарамтерыФункции.ТекстИменФайлов, 3);
            Иначе
                ТекстИменФайлов = "&nbsp;";
            КонецЕсли;
            НоваяСтрока_ = КомментарииДляПочты.Добавить();
            НоваяСтрока_.Комментарий = НовыйКомментарий;
            НоваяСтрока_.Дата = ДатаКомментария;
            НоваяСтрока_.Файлы = ТекстИменФайлов;
        КонецЕсли;
        
		Если ПарамтерыФункции.Свойство("ОтправлятьКлюч") Тогда
			ОповеститьОВыборе(ПредметКомментирования);
		Иначе
			ОповеститьОВыборе(НовыйКомментарий);
		КонецЕсли;
		
		ПредыдущийКомментарий = НовыйКомментарий;
        НовыйКомментарий = "";
        СписокИменФайлов.Очистить();
        Элементы.Комментарии.Обновить();
        Элементы.Комментарии.ТекущаяСтрока = КлючЗаписиРегистра;
        ТаблицаНовыеФайлы.Очистить();
    Иначе
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = ТекстОшибки;
        Сообщение.Сообщить();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьОповещениеПоПочте()
	Если флОтправлятьПочтовыеУведомления Тогда
		// Отправим сообщение о комментариях по электронной почте
		Попытка
			Если СписокПочтовыхАдресов.Количество() > 0 Тогда
				АвторКомментариев = ПользователиКлиентСервер.ТекущийПользователь();
				Если АвторКомментариев = Неопределено Тогда
					АвторКомментариев = Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;
				 
				ТекстПисьма = ТекстПисьма +
					"<BR>
					|<B>Комментарии</B><BR>
					|<table border=""1"">
					|	<tr>
					|		<td width=""20%"">Автор</td>
					|		<td width=""10%"">Дата</td>
					|		<td width=""50%"">Комментарии</td>
					|		<td width=""20%"">Вложение</td>
					|	</tr>
					|";
				Для каждого Комментарий_ Из КомментарииДляПочты Цикл
					ТекстПисьма = ТекстПисьма +
						"<tr>
						|	<td>" + АвторКомментариев + "</td>
						|	<td>" + Комментарий_.Дата + "</td>
						|	<td>" + Комментарий_.Комментарий + "</td>
						|	<td>" + Комментарий_.Файлы + "</td>
						|</tr>
						|";
				КонецЦикла; 
				ТекстПисьма = ТекстПисьма + "</table>";
			
				Для Каждого Строка Из СписокПочтовыхАдресов Цикл
					Письмо = Новый ИнтернетПочтовоеСообщение;
					Письмо.Получатели.Добавить(Строка);
					Письмо.Тексты.Добавить(
						УправлениеЭлектроннойПочтойУХ.ВернутьТекстПисьма("Добавлен комментарий", ТекстПисьма),
						ТипТекстаПочтовогоСообщения.HTML);
					Письмо.Тема = "Добавлен комментарий.";
					УправлениеЭлектроннойПочтойУХ.ЗаписатьПисьмоВРегистр(Письмо, ИсточникПисьма);
					Письмо = Неопределено;
				КонецЦикла;
			КонецЕсли;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиПриЗакрытииНаКлиенте() Экспорт
	Если флОтправлятьПочтовыеУведомления И ПочтаОтправлена <> Истина Тогда
		ПочтаОтправлена = Истина;
		ОтправитьОповещениеПоПочте();
		Если ПроцессЗакрытияФормы = Ложь Тогда
			ПроцессЗакрытияФормы = Истина;
			ЗакрытьФормуСпередачейКомментария();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьКомментарий(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	
	#Если ВебКлиент Тогда
		Если Результат <> Истина Тогда
			// Отказ от установки расширения.
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	ПараметрыФункции = Новый Структура("СписокХранилищ,ТекстИменФайлов,НомерСтроки,Состояние,Файл", Новый Массив, "", 1, 10, Неопределено);
	
	ОбработатьСтрокиФайлов(Неопределено, ПараметрыФункции);
	
	Если ПроцессЗакрытияФормы = Ложь Тогда
		ПроцессЗакрытияФормы = Истина;
		ЗакрытьФормуСпередачейКомментария();
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Значение - меняется в зависимости от вызывающей функции.
//	ДопПараметры - структура:
//		Состояние - номер состояния функции. Начальное состояние 10.
&НаКлиенте
Процедура ОбработатьСтрокиФайлов(Значение, ДопПараметры) Экспорт
	
	Если ДопПараметры.Состояние = 10 Тогда // начало: обработать строку таблицы файлов
		
		Если ДопПараметры.НомерСтроки > ТаблицаНовыеФайлы.Количество() Тогда
			ДопПараметры.Состояние = 11; // закончить обработку, записать данные в регистр
			Если ДопПараметры.СписокХранилищ.Количество() > 0 Тогда
				// поместить файлы в хранилище
				Оповещение = Новый ОписаниеОповещения("ОбработатьСтрокиФайлов", ЭтаФорма, ДопПараметры);
				НачатьПомещениеФайлов(Оповещение, ДопПараметры.СписокХранилищ, , Ложь, УникальныйИдентификатор);
			Иначе
				ОбработатьСтрокиФайлов(Неопределено, ДопПараметры);
			КонецЕсли;
		Иначе
			ДопПараметры.Состояние = 0; // инициализация объекта "Файл"
			Оповещение = Новый ОписаниеОповещения("ОбработатьСтрокиФайлов", ЭтаФорма, ДопПараметры);
			ПолученныйФайл = Новый Файл;
			ПолученныйФайл.НачатьИнициализацию(Оповещение, ТаблицаНовыеФайлы[ДопПараметры.НомерСтроки-1].ПутьКФайлу);
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДопПараметры.Состояние = 0 Тогда // инициализация проверки файлов выполнена
		
		ДопПараметры.Файл = Значение;
		ДопПараметры.Состояние = 1; // проверка существование файла
		Оповещение = Новый ОписаниеОповещения("ОбработатьСтрокиФайлов", ЭтаФорма, ДопПараметры);
		ДопПараметры.Файл.НачатьПроверкуСуществования(Оповещение);
		Возврат;
		
	ИначеЕсли ДопПараметры.Состояние = 1 Тогда // файл существует
		
		Если Значение Тогда
			ДопПараметры.Состояние = 2; // проверка, что это файл, а не каталог
			Оповещение = Новый ОписаниеОповещения("ОбработатьСтрокиФайлов", ЭтаФорма, ДопПараметры);
			ДопПараметры.Файл.НачатьПроверкуЭтоФайл(Оповещение);
			Возврат;
			
		Иначе
			ДопПараметры.Состояние = 20; // перейти на следующую строку
			Сообщение = Новый СообщениеПользователю;
	        Сообщение.Текст = "Не найден файл """ + ТаблицаНовыеФайлы[ДопПараметры.НомерСтроки-1].ПутьКФайлу + """!";
	        Сообщение.Сообщить();
		КонецЕсли;
		
		
	ИначеЕсли ДопПараметры.Состояние = 2 Тогда // это файл
		
		ДопПараметры.Состояние = 20; // перейти на следующую строку
		Если Значение Тогда
			// добавим описание файла для последующего сохранения
			ТаблицаНовыеФайлы[ДопПараметры.НомерСтроки-1].Файл = ДопПараметры.Файл.Имя;
			ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ДопПараметры.Файл.ПолноеИмя);
			ДопПараметры.СписокХранилищ.Добавить(ОписаниеФайла);
			ДопПараметры.ТекстИменФайлов = ДопПараметры.ТекстИменФайлов + ", " + ДопПараметры.Файл.Имя;
		Иначе
			Сообщение = Новый СообщениеПользователю;
	        Сообщение.Текст = "Каталог """ + ТаблицаНовыеФайлы[ДопПараметры.НомерСтроки-1].ПутьКФайлу + """ не может быть записан! Нужно выбрать файл.";
	        Сообщение.Сообщить();
		КонецЕсли;
		
	ИначеЕсли ДопПараметры.Состояние = 11 Тогда // поместили файлы, заканчиваем обработку
		
		Если Значение <> Неопределено Тогда
			ДопПараметры.СписокХранилищ = Значение;
		КонецЕсли;
		ЗаписатьКомментарийВРегистр(ДопПараметры);
		Возврат; // остановка автомата.
		
	КонеЦесли;

	Если ДопПараметры.Состояние = 20 Тогда // перейти к следующей строке таблицы файлов
		ДопПараметры.Состояние = 10; // начать проверку новой строки
		ДопПараметры.Файл = Неопределено;
		ДопПараметры.НомерСтроки = ДопПараметры.НомерСтроки + 1;
		ОбработатьСтрокиФайлов(Неопределено, ДопПараметры);
	КонеЦесли;
		
КонецПроцедуры

#КонецОбласти


#Область ДобавлениеФайлов

&НаКлиенте
Процедура Подключаемый_ПрикрепитьФайл(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		Если Результат <> Истина Тогда
			// Отказ от установки расширения.
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
    Режим = РежимДиалогаВыбораФайла.Открытие;
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
    ДиалогОткрытияФайла.МножественныйВыбор = Истина;
    ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
    
    Оповещение = Новый ОписаниеОповещения("ПрикрепитьФайлЗавершение", ЭтотОбъект);
    ДиалогОткрытияФайла.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
        
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        МассивФайлов = ВыбранныеФайлы;
        Для Каждого ИмяФайла Из МассивФайлов Цикл
            //ВыбФайл = Новый Файл(ИмяФайла);
            НовФайл=ТаблицаНовыеФайлы.Добавить();
            НовФайл.ПутьКФайлу=ИмяФайла;
            НовФайл.Файл=ИмяФайла;
        КонецЦикла;
    Иначе
        ПоказатьПредупреждение(, НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
    КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ВыбратьИЗаписатьФайл

&НаКлиенте
Процедура Подключаемый_ВыбратьИЗаписатьФайл(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		Если Результат <> Истина Тогда
			// Отказ от установки расширения.
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
    Режим = РежимДиалогаВыбораФайла.Открытие;
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
    ДиалогОткрытияФайла.МножественныйВыбор = Истина;
    ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
    
    Оповещение = Новый ОписаниеОповещения("ВыбратьИЗаписатьФайлЗавершение", ЭтотОбъект);
    ДиалогОткрытияФайла.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗаписатьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
        
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        МассивФайлов = ВыбранныеФайлы;
        Для Каждого ИмяФайла Из МассивФайлов Цикл
            //ВыбФайл = Новый Файл(ИмяФайла);
            НовФайл=ТаблицаНовыеФайлы.Добавить();
            НовФайл.ПутьКФайлу=ИмяФайла;
            НовФайл.Файл=ИмяФайла;
		КонецЦикла;
		
		
		ПараметрыФункции = Новый Структура("СписокХранилищ,ТекстИменФайлов,НомерСтроки,Состояние,Файл,ОтправлятьКлюч", Новый Массив, "", 1, 10, Неопределено, Истина);
	
		ОбработатьСтрокиФайлов(Неопределено, ПараметрыФункции);
	
    Иначе
        ПоказатьПредупреждение(, НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
